{
  "intro_text": "ようこそ、幕末の海を駆けるタイムスリップ冒険ゲーム『坂本龍馬異聞録 〜英雄伝と究極選択〜』へ！\n\nこのゲームでは、あなたが、ある日突然幕末の日本にタイムスリップし、激動の時代を駆け抜けた坂本龍馬とともに、日本の未来を変える大航海を体験することができます。気がつくと、あなたの手には現代のスマートフォンが…その中には、頼れるAIアプリ『凪（ナギ）』が搭載されています。\n\nナギのサポートを受けながら、あなたは海援隊の一員として、航海、交渉、冒険の渦に飛び込んでいくことになるでしょう。\n\n✅ あなたが体験できること：\n\nこの物語では、幕末の長崎を舞台に、坂本龍馬や海援隊の仲間たちと出会い、絆を深めながら、あなたの選択で物語と結末が変化していきます。AIの知恵を駆使して航海や交渉、危機を乗り越え、歴史の波を乗り切るか飲まれるか──そのすべてはあなた次第です。\n\n❤️ ライフポイント制について：\n\n行動によってライフポイント（LP）が増減し、無謀な行動を取るとLPが減ってしまいます。LPが0になるとゲームオーバーとなり、最大値は3です。\n\n⚠️ 注意事項：\n\nこのゲームはストリーム形式で進行し、再読み込みすると最初からやり直しになります。戻るボタンの使用はご遠慮ください。\n\n🎮 プレイの準備：\n\nプレイを始める前に、あなたの名前を入力してください。性別に関係なく、誰でも冒険の主人公になれます。\n\nさあ、歴史を旅する冒険のはじまりです。AIアプリ『凪（ナギ）』とともに、坂本龍馬と海援隊の伝説へ飛び込みましょう！\n",
  "chapters": {
    "1": {
      "title": "潮騒の呼び声",
      "image": "img_chapter1_2.png",
      "choice_image": "img_chapter1_3.png",
      "text": "休日の午後。窓から差し込む日差しの中、あなた──{player_name}はリビングでスマホを操作していた。\n",
      "button_label_r": "▶続きを読む",
      "story": "アイコンは青い波に帆船のマーク。\n\n「……こんなの、入れた覚えないんだけど？」好奇心に負けて、タップすると画面が真っ白になり、強烈な光に包まれる。次の瞬間、耳をつんざくような波の音と、鼻を刺す潮の匂いが君を襲った。\n\n波の音が遠くから聞こえる。気付けば足元は砂浜、見上げれば見知らぬ港町──ここはどこだろう？ポケットの中のスマホが震え、画面にAIアプリ「ナギ」が現れた。\n\n「ようこそ、{player_name}さん。落ち着いてください。ここは1867年の長崎──日本が大きく変わる直前の時代です」突然の説明に困惑する間もなく、ナギは優しい声で続ける。\n\n「この時代、日本は“幕末”と呼ばれる大混乱の時代に突入しています。徳川幕府という政府の力が弱まり、各地の藩（今で言う県のようなもの）がそれぞれ動き始めているのです」周囲を見渡せば、着物姿の人々が行き交い、外国人らしき姿もちらほら。不思議な熱気に包まれた町──それがこの幕末の長崎だった。\n\n「特にここ長崎は、海外と日本をつなぐ重要な貿易港。その中でも海援隊という組織が、ひときわ注目を集めています。リーダーは坂本龍馬。商人であり、政治家であり、自由人──未来の日本では“英雄”として語られる男です」\n\n「坂本龍馬……名前は聞いたことがあるけど……」\n\nナギは頷くように説明を続ける。「現代の日本では、彼は“国を動かした英雄”として非常に有名ですが、実際の史料では“商売熱心で人当たりのいい男”程度の扱いにとどまることも多いのです」\n\nふと視線を上げると、船の前で威勢の良い声が響く。\n\n「おい、そこの新人！手伝え！」どうやら働き手として間違われたようだ。スマホが再び震え、ナギがささやく。「まずは彼らの輪に加わりましょう。ここでの体験が、あなたの運命を大きく動かすかもしれません」\n",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "はい！手伝います！",
          "result": {
            "result_image": "img_chapter1_3.png",
            "text": "「はい！手伝います！」と元気に返事をすると、周囲の男たちが笑いながら声をかけてくる。\n\n「お、素直な奴だな！よし、これを運んでくれ！」渡されたのは、ずっしりと重たい荷物。船の甲板では、あちこちで大声が飛び交い、忙しそうに作業が進んでいる。作業をしながら、ふとナギの声が耳元で響く。\n\n「良い判断です、{player_name}さん。ここでは“素直に行動すること”が、人々の信頼を得る一番の近道ですよ」荷物を運び終えた頃には、男たちの態度も柔らかくなり、「気立てのいい奴じゃないか！」と肩を叩かれる。視線を感じて見上げれば、船の上からひときわ存在感のある男がこちらを見ている。堂々とした立ち姿、穏やかな笑み──ナギが言っていた坂本龍馬だろうか。龍馬はにこやかに声をかけてくる。\n\n「見ない顔だな。名はなんていう？」\n\n忙しい港町の喧騒の中、ひとつの小さな縁が、静かに結ばれた瞬間だった。\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "2"
          }
        },
        {
          "text": "え、ここはどこなんですか？",
          "result": {
            "result_image": "img_chapter1_3.png",
            "text": "「え、ここはどこなんですか？」と慌てて問いかけると、男たちが怪訝そうにこちらを振り向く。\n\n一瞬、空気がピリついたが、ナギの声が耳元に響いた。\n\n「落ち着いて、{player_name}さん。\n今は1867年、ここは幕末の長崎です。\n未来から来たあなたにとっては驚きかもしれませんが、焦らないでください」\n\n男たちの視線を感じつつ、深呼吸しながら状況を把握しようとする。\n\nすると、ひとりの男が苦笑しながら声をかけてくる。\n\n「なんだ、迷い込んだのか？\nまあ、せっかくだ。手伝ってくれれば腹も膨れるぞ」\n\n戸惑いながらも荷物を持つ手を差し出せば、少しずつ空気も和らいでいく。\n\nナギがそっと囁く。\n\n「人々との距離を縮めるには、まず行動からです。\n焦らず、一歩ずつ関わりを深めていきましょう」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "2"
          }
        },
        {
          "text": "いや、無理無理、逃げる！",
          "result": {
            "result_image": "img_chapter1_3.png",
            "text": "「いや、無理無理、逃げる！」と心の中で叫び、足早に港の外へ向かう。\n\nだが、すぐ背後から怒号が飛んだ。\n\n「待て、こら！逃げるんじゃねえ！」\n\n必死に走るが、入り組んだ町の路地に迷い込み、行き止まりに追い込まれる。\n\n男たちに囲まれ、もう逃げ場はない。\n\nナギの声が静かに耳元に響く。\n\n「逃げても無駄です、{player_name}さん。\nここは歴史の渦中。運命は、あなたを引き戻す力を持っています」\n\n結局、男たちに捕まえられ、強制的に港へ連れ戻された。\n\n「変わった奴だな……だが、手は足りねぇ。お前も働け！」\n\n仕方なく荷物を持つことになり、汗をかきながら作業を始める。\n\nナギは小さく笑いながら囁く。\n\n「どうやら、冒険は避けられないようですね。\nでも、時には流れに身を任せるのも悪くありません」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "2"
          }
        }
      ]
    },
    "2": {
      "title": "海援隊、出港準備",
      "image": "img_chapter2.png",
      "choice_image": "img_chapter2_2.png",
      "text": "荷物を運び、船を磨き、汗を流す。忙しく動く海援隊の若者たちに混じって、{player_name}も慌ただしく働いていた。",
      "button_label_r": "▶続きを読む",
      "story": "ナギの声が、耳元でやさしく響く。\n\n「海援隊は、坂本龍馬が立ち上げた貿易と航海の組織です。当時としては画期的な存在で、幕府にも、薩摩藩・長州藩にも属さない独立勢力。“新しい時代の旗手”とも言われました」海援隊の中心には「いろは丸」と呼ばれる船があった。ナギが説明を続ける。\n\n「“いろは丸”は、日本でも数少ない蒸気船です。海援隊の象徴でもあり、龍馬たちが誇りにする船でもあります。実は、後に“いろは丸事件”という日本初の海難賠償交渉の舞台となる船でもあるのです」\n\nその時、作業中の仲間が言った。「龍馬さん、いろは丸の積荷はどうするんだ？ 紀州藩の船が接触しそうだって騒いでるが」\n\n「まぁ、なるようになるだろう。気にするな」\n\n坂本龍馬は、のんびりとした笑顔で軽く返した。その様子に、{player_name}の心には違和感が芽生えた。「あれ？この人、意外と普通すぎないか？」\n\n現代で語られる坂本龍馬は、時代を切り開くカリスマで、鋭く先を読む天才──だが、目の前の龍馬は、どこか人懐っこい兄ちゃんのようだ。\n\nナギが静かにささやく。「それは当然です。現代の坂本龍馬像は、後世の小説やドラマでかなり美化されたもの。実際の龍馬は、商才のある調整役。英雄というより“交渉人”に近い人物です」\n\n作業を終えた頃、ひとりの隊士が慌てて駆け込んでくる。「大変だ！ いろは丸が接触事故を起こした！」仲間たちがざわつくが、龍馬は意外にも静かだった。「まぁ、壊れりゃまた新しいのを探せばいい。大したことじゃないさ」\n\nそれを聞いた瞬間、ナギの声が鋭く変わる。\n\n「これはおかしい……！本来、ここから坂本龍馬が“いろは丸事件の交渉人”として動き、日本初の海難賠償交渉を成立させるはずです。それが──ズレました。あなたがここに来て、龍馬の選択が変わったのです」\n\nナギが、未来のシミュレーションデータを即座に提示する。「もしこのまま進めば、未来の歴史から坂本龍馬の名が消える可能性が出てきました。現代で語られる“坂本龍馬伝説”は消滅し、日本は英雄なき国になる可能性があります」胸がざわつく。自分が何気なくここに来たことで、未来の日本が大きく変わってしまう。英雄の伝説が、この手で消えてしまう。\n\nナギの声は静かだが、重く響く。\n\n「{player_name}さん、歴史の原則では“過去への干渉は禁物”です。しかし──これは例外です。このままでは、未来は取り返しがつかなくなります。あなたの行動が、坂本龍馬の未来を左右するのです」\n\n心の奥底から、使命感が沸き上がる。「このままじゃダメだ。俺が、坂本龍馬を“未来の英雄”にしなくちゃいけないんだ──！」\n\nここから、プレイヤーの“裏ミッション”が始まる。\n",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "坂本さん、交渉はあなたがやるべきです！",
          "result": {
            "text": "言葉を飲み込む暇もなく、気付けば声を張り上げていた。\n\n「坂本さん、交渉はあなたがやるべきです！」その場の空気が、一瞬で凍り付く。隊士たちが驚き、龍馬も目を丸くする。だが、龍馬はすぐに笑った。\n\n「ほう、ずいぶんハッキリ言うな。理由は？」一瞬、迷いがよぎるが、ナギがそっと囁く。「未来の日本にとって、ここは龍馬が“交渉人”として動くべき瞬間です」その声に背中を押され、{player_name}は腹を括った。\n\n「あなたが動けば、未来は大きく変わります。ここは……あなたしかいません」龍馬はしばらく黙ったあと、ふっと笑みを浮かべた。\n\n「面白い奴だ。そこまで言うなら、やってみるか」その瞬間、ナギが静かに告げる。「これで、未来の“坂本龍馬伝説”が繋がりました。{player_name}さん、あなたの役割は今、正式に始まりました」\n\n胸の奥に、熱い決意が芽生える。未来を守るため、坂本龍馬を英雄に──裏ミッション、ここに発動。\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 1,
            "next": "3"
          }
        },
        {
          "text": "何も言わずに観察しよう",
          "result": {
            "text": "胸の奥に渦巻く焦りと、未来の危機。だが、今すぐに動くのは、得策ではない気がした。\n\n「……今はまだ、観察だ」荷物を運ぶふりをしながら、龍馬の様子をじっと伺う。ナギが穏やかに囁く。「冷静な判断です、{player_name}さん。未来を守るための行動は、時に“待つこと”も必要です」その言葉に少し救われる。\n\n龍馬は相変わらずのんびりと笑い、仲間と酒を酌み交わしている。だが、未来では「日本初の海難賠償交渉の立役者」と称えられる男が、今はまるで別人のように思えて仕方なかった。ナギの声が、少しだけ重くなる。\n\n「未来の歴史は、あなたの行動次第で変わります。静かに観察しながら、動くべき時を見極めましょう」この時代の空気の重みを感じながら、心に誓う。「必ず、龍馬を“未来の英雄”に導く」裏ミッションの火は、確かに灯った。\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "3"
          }
        },
        {
          "text": "やっぱり、自分には関係ない……",
          "result": {
            "text": "「やっぱり、自分には関係ない……」そう呟きつつも、足は港を離れず、その場に立ち尽くしていた。龍馬の笑い声が遠くから聞こえる。未来の英雄──その名が、静かに消えかけている現実。ナギが静かに語る。\n\n「{player_name}さん、あなたはすでに歴史の渦中にいます。ここで目を逸らしても、未来への影響は避けられません」\n\n胸の奥に、重たいものがのしかかる。「あなたがこの時代に来たことで、未来の英雄が消えかけています。それは、あなた自身の責任でもあるのです」息が詰まるような現実。逃げても逃げ切れないことを、痛いほど理解させられる。やがて心の奥から、じわりと熱が湧いてくる。\n\n「……放ってはおけない。必ず、何かをしなければ──」\n\nその決意はまだ小さく、揺らぎながらも確実に芽生えていた。未来の歴史を守るための、裏ミッションの幕が静かに開く。",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "3"
          }
        }
      ]
    },
    "3": {
      "title": "運命の導き手",
      "image": "img_chapter3.png",
      "choice_image": "img_chapter3_2.png",
      "text": "坂本龍馬の活躍で、いろは丸の件は無事に収まりつつあった。その背中を見つめながら、{player_name}は密かに覚悟を決めていた。",
      "button_label_r": "▶続きを読む",
      "story": "「未来の英雄伝説を守るため、ここからは導き手として動く」ある晩、港町の茶屋で龍馬を見かける。彼は酒を片手に、穏やかな表情で夜空を眺めていた。龍馬は、{player_name}の姿に気付くと、手招きする。\n\n「おう、最近よく顔を合わせるな。船の上じゃ、すっかり働き者だって評判だぞ。せっかくだ、こっちに座れや」自然な流れで席に着くと、龍馬はにやりと笑った。「しかし、不思議な空気を纏ってるな。前は何をしてたんだ？」一瞬、言葉に詰まるが、ナギが静かに囁く。\n\n「ここは“占い師”としての顔を見せる好機です。未来の知識を“占い”として利用しましょう」\n\n「……少し、占いのようなことをしていました」\n\n龍馬は大きく笑った。「ははは、占いか！面白ぇな。じゃあ、俺の未来でも占ってみろよ。ま、どうせ酒の肴みたいなもんだろうがな」\n\n軽口に乗る形で、ナギの指示に従い、未来の小さな出来事を占いのふりで伝える。「数日以内に、西の港に停泊する大商人の船との大きな取り引きに成功しますよ。その商人は、銀細工の根付をいつも腰に付けています」\n\n龍馬は笑い飛ばす。\n\n「ははっ、そりゃまた具体的だな！ま、信じるも信じねぇも自由ってやつだ。面白い奴だぜ」\n\nその場は、冗談半分で終わった。\n ──しかし、数日後。\n\nナギの予言通り、港に大商人の船が現れ、大きな取引が成功。その商人は、まさしく銀細工の根付を腰に付けていた。\n\n「……まさか、アイツの言った通りじゃねぇか……？」\n\n龍馬は、茶屋で再び{player_name}に出会ったとき、じっと見つめてくる。「お前、ただの占い師じゃねぇな。……妙に現実的すぎる“占い”だ。だが、不思議と悪い気はしねぇ。よし、試しにもう少し俺のそばで知恵を貸してみろ。今の時代、ちょっと変わった知恵も悪くねぇ」\n\nナギの声が響く。\n\n「これで、あなたは坂本龍馬の“導き手”としての第一歩を踏み出しました。未来を守る旅が、いよいよ本格的に始まります」胸の奥に、確かな使命感が芽生える。「必ず、坂本龍馬を未来の英雄に導いてみせる──」\n",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "ぜひ力になります！",
          "result": {
            "text": "「ぜひ力になります！」\n迷いのない声で答えると、龍馬は一瞬驚いたように目を丸くする。\n\nしかし、すぐにニッと笑って、豪快に肩を叩いてきた。\n\n「ははは！やっぱり面白ぇ奴だ！\n普通はもうちょい渋るもんだが、まっすぐなのはいいことだ。\nよし、じゃあ今日から俺の“知恵袋”だ！」\n\n周囲の空気も一気に和らぎ、店の常連客たちも笑顔を浮かべる。\n\nナギの声が耳元に響く。\n\n「これで、あなたは龍馬の“参謀”として迎え入れられました。\n未来を守る裏ミッションは、ここから本格的に始まります」\n\n龍馬は酒を注ぎながら、穏やかに続ける。\n\n「俺はこういうまっすぐな奴が好きなんだ。\nきっと、これからの時代には、そういう奴が必要になる」\n\nその言葉に、不思議な力強さを感じる。\n\nこの夜、{player_name}は坂本龍馬のそばに座り、\n“未来の英雄”を陰で支える旅の第一歩を、確かに踏み出した。",
            "button_label_n": "▶次の章へ進む",
            "lp": 1,
            "next": "4"
          }
        },
        {
          "text": "条件次第ですね。と交渉する",
          "result": {
            "text": "「条件次第ですね。私にも得がないと、ただでは動けませんよ」\n\nあえて真顔で返すと、龍馬は目を細めてじっとこちらを見つめた。\n\n一瞬、空気がピリッと張り詰める──が、次の瞬間、龍馬は大笑いする。\n\n「ハハッ！面白ぇな！正直で欲のある奴は嫌いじゃねぇ。\nむしろ、そういう現実的な奴の方が信頼できるってもんだ」\n\nそう言って、ニヤリと笑いながら酒を注いでくる。\n\n「じゃあ、こうしよう。お前には俺の“右腕”として動いてもらう。\nその代わり、俺が何か大事なものを手に入れたら、お前にも半分やる。\nどうだ、悪い話じゃねぇだろ？」\n\nナギが静かに囁く。\n\n「これは、未来を守るための“最適解”です。\nビジネスのような形でも、あなたが関われば未来の流れは正しく保たれます」\n\n龍馬は酒を飲み干しながら、ニヤリと笑う。\n\n「これからの時代は、利害も正直に話せる奴が必要なんだ。\n頼むぜ、相棒」\n\n心の奥底で、プレイヤーは確かに“使命の炎”を感じ始めていた。\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "4"
          }
        },
        {
          "text": "実は船酔いがひどくて…",
          "result": {
            "text": "「……実は、船酔いがひどくて……海の旅はちょっと遠慮したいんです」\n\n苦笑しながら告げると、龍馬は一瞬きょとんとする。\n\nだが、次の瞬間、豪快に笑い声を上げた。\n\n「はははは！バカ言え！そんなもん、慣れだ慣れ！\n俺だって最初は酔ったもんさ。でも、海の上で吐いてりゃ、そのうち慣れる！」\n\n周囲の常連客たちも大笑い。\n龍馬はニヤニヤしながら、ぐいっと酒を差し出してくる。\n\n「ま、海が怖けりゃ陸で頭を使えばいい。\nお前の知恵は、船の上でも陸でも役に立つだろ？\n逃げ道なんざねぇぞ。今の時代、みんなで未来を作るしかないんだ」\n\nナギの声が微かに笑いながら囁く。\n\n「龍馬のこういう“巻き込み力”は、時代を超えても通用するんですね。\n結果として、あなたは導き手の役目を引き受けることになります」\n\n笑いの中で、龍馬の手を握られ、逃げ場はなくなった。\n\nだが、心の奥底では──\n「不思議と、悪い気はしない。\nこれも、運命の流れなのかもしれない」\n\n静かに、未来を守る旅の火蓋は切られた。",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "4"
          }
        }
      ]
    },
    "4": {
      "title": "ナギの未来解説",
      "image": "img_chapter4.png",
      "text": "龍馬との不思議な出会いの夜が終わり、港町の夜風が心地よく吹き抜ける。",
      "button_label_r": "▶続きを読む",
      "story": "{player_name}は一人、静かに歩きながら、心の奥に残る使命感を噛みしめていた。\n\nその瞬間、スマホが静かに震え、ナギの声が耳元に響く。\n\n「{player_name}さん、よろしければ、\n坂本龍馬という人物が未来でどう語られているか、まとめてご説明しましょうか？」\n\n画面に映るナギは、いつもよりも少し真剣な表情に見えた。\n\n◉ ナギの未来解説スタート\n\n「現代では、坂本龍馬は“日本を変えた英雄”として、多くの人に知られています。\n特に以下の出来事が、英雄像の柱になっています。」\n\nナギは丁寧に5つのポイントを示す。\n\n1️⃣ 薩長同盟の仲介\n\n「敵対していた薩摩藩と長州藩を結び付けた“同盟の仲介役”として有名です。」\n\n2️⃣ 大政奉還の影の仕掛け人\n\n「幕府から政権を朝廷に返させた“体制奉還”に関与したと言われています。」\n\n3️⃣ 船中八策の構想\n\n「未来の国家構想を船の上でまとめたと言われる“船中八策”も有名です。」\n\n4️⃣ 海援隊の創設と貿易事業\n\n「日本初の商社・海援隊を立ち上げた起業家的側面も評価されています。」\n\n5️⃣ 悲劇の暗殺（近江屋事件）\n\n「英雄の最期として、暗殺されたことが“伝説化”に拍車をかけました。」「坂本龍馬がなぜ暗殺されたのか──これは、現代でも議論の的です。ただし、現在の有力な説としては、『新しい時代を切り開いたことで多くの敵を作ったこと』、『政治的な駆け引きに巻き込まれたこと』が原因と考えられています。」\n\nナギは慎重な口調で続ける。\n\n「暗殺の実行犯についても、いまだにはっきりとした結論は出ていません。幕府の関係者、対立藩の過激派、商人たちの争い──複数の説が存在し、真相は深い闇に包まれたままです。」\n\nそして、ナギは最後にピシッと釘を刺すように告げる。\n\n「もしあなたが、この時代で暗殺の真相を探ることも可能ですが、それは非常に危険です。私としては、深入りしないことを強く推奨します。」\n\n\nナギは、じっとこちらを見つめて続ける。\n\n「ですが──これらの多くは、後世の小説やドラマで美化された部分も多いのです。\n史実として確定しているのは、意外と少ないんですよ」\n\nその事実に、思わず息を呑む。\n\n「とはいえ、現代の日本にとって、坂本龍馬は“必要な英雄”です。\nあなたの使命は、これらの未来の出来事を“適切に成立させる”こと。\n歴史の流れは、あなたの選択にかかっています」\n\nナギは一拍置いて、穏やかに笑う。\n\n「せっかくですから、最後に坂本龍馬にまつわるちょっと意外なクイズを一問、いかがでしょう？\n少し息抜きも大切ですからね。ただし、不正解だとLPは減りますよ。\n\nそれでは問題です！坂本龍馬が好きだった、と言われているものは何でしょうか？」",
      "button_label_c": "▶回答を選んでください",
      "choices": [
        {
          "text": "お風呂好き",
          "result": {
            "text": "ナギが微笑みながら答える。\n\n「正解です。坂本龍馬は大のお風呂好きとして知られています。\n実際、彼は1日に何度も湯船に浸かり、湯船の中で作戦を練ることも多かったそうですよ」\n\n「当時としては珍しい“お風呂マニア”だった坂本龍馬。\n“英雄”としてのイメージとは少し違う、人間味あふれる一面ですね」\n\nナギはやさしく締めくくる。\n\n「この“意外なギャップ”も、龍馬の魅力のひとつなのかもしれません」",
            "button_label_n": "▶次の章へ進む",
            "lp": 1,
            "next": "5"
          }
        },
        {
          "text": "甘いもの好き",
          "result": {
            "text": "ナギはふっと微笑んで答える。\n\n「残念ながら、これは違います。実際の坂本龍馬は“甘いもの好き”という記録は残っていません」\n\nただ、ナギは続ける。\n\n「ですが、龍馬は人懐っこくて、食事の席で周囲を和ませるのが得意だったとも言われています。\n団子を食べながら作戦を練る──そんな姿も、意外と似合うかもしれませんね」\n\nナギは最後に静かに囁く。\n\n「坂本龍馬には、まだまだ知られていない“隠れた顔”も多いんですよ」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "5"
          }
        },
        {
          "text": "女性の髪型マニア",
          "result": {
            "text": "ナギはくすっと笑って答える。\n\n「これはさすがにフィクションですね。\n坂本龍馬に“髪型マニア”の記録は一切ありません」\n\nでも、ナギは少し楽しげに続ける。\n\n「ただ、龍馬は女性に人気の高い人物だったことは確かです。\nその飾らない性格と行動力で、多くの女性に慕われたという逸話は数多く残っています」\n\nナギは最後にこうまとめる。\n\n「坂本龍馬は“硬派”に見えて、意外と社交的で柔らかい一面もあったんですよ」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "5"
          }
        }
      ]
    },
    "5": {
      "title": "薩長同盟の影",
      "image": "img_chapter5.png",
      "choice_image": "img_chapter5_2.png",
      "text": "海援隊の仕事にも慣れ、{player_name}は坂本龍馬の“知恵袋”としての役割を徐々に果たし始めていた。",
      "button_label_r": "▶続きを読む",
      "story": "そんなある日、ナギが静かに語りかけてくる。\n\n「いよいよ未来の歴史を“正しい流れ”に戻す、大きなミッションが訪れます。\nその名も──薩長同盟です」\n\n耳慣れたその言葉に、思わず顔を上げる。\n\nナギは、優しい声で丁寧に説明を続けた。\n\n「薩摩藩と長州藩は、当時の日本で一番お金と武力を持っていた藩です。\nこの二つが手を組めば、幕府がどんなに偉くても絶対に勝てない。\nだから、ここで薩摩と長州が仲良くなると、幕府の時代は終わるんです」\n\n分かりやすく、重みのある言葉だった。\n\n「現代の日本では、“坂本龍馬こそが薩長同盟を実現させた英雄”として知られています」\n\n──しかし。\n\nその夜、海援隊の仲間たちが酒を酌み交わしながら、愚痴をこぼし始めた。\n\n「薩摩の連中は相変わらずだな。長州とやり合ってる場合じゃねぇのに…」\n\n「どっちも頑固だから、誰も手を出せねぇ。まったく、やってられねぇよ」\n\n龍馬はその会話を、静かに笑いながら聞き流していた。\nそして、杯を傾けたあと、ふと呟く。\n\n「……ま、俺には関係ねぇ話だがな。\nけど──もし俺が間に入って、あの二つを結び付けたら、どうなるんだろうな？」\n\nそれはあくまで、酒の席での冗談半分の軽口だった。\nしかし、その言葉を聞いた瞬間、ナギの声が鋭く響く。\n\n「{player_name}さん、今の一言が歴史の分岐点です。\n実は、坂本龍馬は本当に薩長同盟にはあまり深く関わっていなかったというのが、最新の歴史研究の見解です。\nけれども、現代の日本では“坂本龍馬こそが薩長同盟の仲介者”という英雄像が完全に定着しています」\n\nナギの口調が、さらに真剣さを増す。\n\n「ここであなたが動かなければ、未来の日本から“坂本龍馬”の名は消えかねません。\nこれこそ、あなたが“裏の歴史工作”を担うべき瞬間です」\n\n龍馬は酔いもあってか、少し笑いながらこちらを見る。\n\n「なあ、どう思う？ 俺があんな連中をまとめるなんて、笑える話だろ？」\n\nナギが囁く。\n\n「今こそ、未来のための“偽りの導き”を。\nここから、あなたの本当のミッションが始まります」\n\nプレイヤーは、覚悟を胸に、龍馬に答える。\n\n",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "必ずこの国は良くなります。あなたが動くべきです",
          "result": {
            "text": "「必ずこの国は良くなります。あなたが動くべきです！」\n\n迷いなくそう告げると、龍馬は驚いたように目を細めた。\nしかし、すぐに唇をゆるめ、愉快そうに笑い出す。\n\n「ははは！お前、なかなか肝の据わったことを言うな。\nけど、嫌いじゃねぇ。そうだな……俺が動かなきゃ、誰が動くってんだ？」\n\n龍馬は杯を一気に飲み干すと、真剣な目でこちらを見つめた。\n\n「お前のその言葉、肝に銘じるぜ。\n面白ぇ──だったら、俺がやってやろうじゃねぇか！」\n\nナギの声が、嬉しそうに耳元で響く。\n\n「これで坂本龍馬は、未来の英雄としての一歩を踏み出しました。\nあなたの行動が、歴史を“正しい流れ”へ戻しました」\n\n龍馬は笑いながら続ける。\n\n「さて、そろそろ本気でこの国を変える時が来たかもしれねぇな」\n\nプレイヤーは、龍馬の覚悟の火が確かに灯るのを感じた。\n未来を守る冒険は、ここから本格的に始まる。\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 1,
            "next": "6"
          }
        },
        {
          "text": "これはあなたが決めることです",
          "result": {
            "text": "「これはあなたが決めることです」\n\nプレイヤーは、あえて静かに龍馬に委ねた。\n龍馬は少し考え込んだ後、肩をすくめるように笑う。\n\n「ま、俺が決めりゃいい話だな。けど、正直……今はそんな気分じゃねぇ。\n薩摩も長州も、ほっときゃ勝手に転がっていくだろ」\n\nそう言って、龍馬は笑い飛ばし、話題を変えてしまった。\nプレイヤーは、内心で焦りを覚える。\n\nナギの声が冷静に囁く。\n\n「やはり、このままでは坂本龍馬は動きません。\n未来の英雄像も、いまだ不安定なままです」\n\nだが、ナギは続ける。\n\n「ただし、まだ完全に終わったわけではありません。\nあなたと私の手で、ここから龍馬を上手く動かす必要があります」\n\nその数日後、プレイヤーはナギと慎重に作戦を練り、\n龍馬の周囲の仲間たちや商人たちに働きかけ、\n間接的に“薩長同盟の意義”を耳に入れ続けた。\n\n少しずつ、龍馬の態度に変化が現れ始める。\n\n「……あいつら、もしかすると、組んだ方が面白いかもしれねぇな……」\n\nナギが微かに笑う。\n\n「未来の可能性は、かすかに繋がりました。\nこれからの行動次第で、歴史はまだ修正できます」\n\nプレイヤーは、重く息を吐き、心を決めた。\n\n「次こそ、絶対に未来を正しい方向へ導く──」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "6"
          }
        },
        {
          "text": "未来の歴史は自然に流れるはず。自分は静かに見守るべきだ",
          "result": {
            "text": "「未来の歴史は自然に流れるはず。自分は静かに見守るべきだ」\n\nプレイヤーは静かに杯を置き、龍馬に何も言わず、その場を離れた。\n龍馬はいつものように笑い、気にも留めていなかった。\n\n──数日後。\n\nナギの声が、静かに、だが深刻に響く。\n\n「{player_name}さん、未来の観測結果に異常があります。\nこのままでは坂本龍馬は、薩長同盟に一切関与せず、\nただの商人として平凡な人生を歩む未来が濃厚です」\n\nナギは、なおも落ち着いた声で続けた。\n\n「今なら、まだ間に合います。\nあなたが今すぐ動けば、龍馬を正しい道へ戻せる可能性は残っています」\n\nプレイヤーは、急いで龍馬に再び会いに行き、必死に説得を試みた。\n\nしかし──龍馬は、もう完全に心を閉ざしていた。\n\n「……悪いな。もう、そんな話は聞きたくねぇ。\n俺は、俺のやりたいように生きるよ。\n面倒事は、もうまっぴらだ」\n\nにこやかに笑うその表情は、もう変わらなかった。\n\nナギの声が、かつてないほど冷たく、淡々と告げる。\n\n「未来の確定を確認しました。\n坂本龍馬は歴史の表舞台に立つことなく、\n小さな商人として平穏な人生を終えました」\n\n画面には、未来の日本の姿が映し出される。\n\n「現代の日本から“坂本龍馬”という名前は完全に消えました。\n歴史の教科書にも、銅像にも、小説にも、彼の名は一切登場しません。\n英雄なき日本──\n“自分の力で未来を切り開ける”という、希望の象徴を失った日本です」\n\nナギの声は、どこか哀しげだった。\n\n「日本は、もう一人の坂本龍馬を持たない国になりました。\nかつて、彼の存在が日本人に与えていた“勇気”や“自信”は、\n誰にも思い出されることはありません」\n\n静かに、世界は暗転する。",
            "button_label_n": "▶次へ",
            "lp": -3,
            "next": "6"
          }
        }
      ]
    },
    "6": {
      "title": "交渉戦術を練る夜",
      "image": "img_chapter3.png",
      "text": "薩摩藩と長州藩を結び付ける──坂本龍馬はすでにそのために動き始めていた。",
      "button_label_r": "▶続きを読む",
      "story": "その夜。\n龍馬は{player_name}と酒を酌み交わしながら、ふと苦笑いをこぼす。\n\n「いざ動くとなると、これがまた厄介でな。\n西郷も桂も、どっちも頑固者だ。下手を打てば、話はすぐに潰れちまう」\n\nその言葉を受け、ナギが耳元で囁く。\n\n「ここが、あなたの出番です、{player_name}さん。\n私は薩摩・長州の当時の交渉担当者、\n西郷隆盛と桂小五郎の性格・価値観・交渉スタイルのデータをすべて把握しています」\n\nナギは淡々と、だが頼もしい口調で続けた。\n\n「西郷は“義理と情”を重んじ、正義や誇りを大切にする男。\n桂は“現実的で損得勘定に敏感”な戦略家です。\n交渉では、この二人の性格に合わせた“最適な戦術”が必要です」\n\n{player_name}は頷き、龍馬に目を向ける。\n\n「交渉の作戦、どんな方向性にするか考えてみませんか？\nそれぞれに合った戦術を選ぶだけで、結果は大きく変わりますよ」\n\n龍馬は目を細め、ニヤリと笑う。\n\n「面白ぇな。お前の“占い”も、今回は本格的だな。\nよし、聞かせてもらおうじゃねぇか。どんな手がある？」\n\nあなたが龍馬に授ける「未来の交渉戦術」を選択してください。",
      "button_label_c": "▶戦術を選択してください",
      "choices": [
        {
          "text": "ドア・イン・ザ・フェイス戦術",
          "result": {
            "text": "ナギがすぐに説明を始めた。\n\n「ドア・イン・ザ・フェイス戦術は、“譲歩を引き出す交渉術”です。\nまず無理めな要求をぶつけて断らせた後、\n本命の小さな要求を出して“譲歩してもらった”と思わせる心理戦術です」\n\nナギは冷静に続ける。\n\n「薩摩には“大きな軍事支援”、長州には“莫大な資金援助”を最初に示し、\nすぐに“もっと現実的な条件”に落として交渉を成立させる戦術です」\n\n{player_name}は龍馬に耳打ちする。\n\n「まずは極端な提案をぶつけて、断らせてから本命を出す……\n“引き下がる交渉”でいきましょう」\n\n龍馬は目を細め、ニヤリと笑う。\n\n「はは、ずいぶんえげつねぇ手口だな。だが……面白ぇ、やってみるか」\n\nナギが静かに囁く。\n\n「この戦術は、現実的で即効性がありますが、\n未来には“損得の打算で結ばれた同盟”として語られます。\n効果はあるものの、未来の美しさには欠けるため、LPは増減なしです」\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "7"
          }
        },
        {
          "text": "フレーミング戦術",
          "result": {
            "text": "ナギがすぐに説明を始めた。\n\n「フレーミング戦術は、“大義名分や世間の目”を利用する交渉術です。\n“これは日本全体の問題だ”“国の未来がかかっている”と強調し、\n相手に“断れない空気”を作り出す戦法です」\n\nナギは淡々と続ける。\n\n「薩摩と長州に“国中が注目している”と伝え、\n大義を盾に交渉を進める方法です」\n\n{player_name}は、静かに龍馬に助言する。\n\n「世間の目や大義を利用して、\n“これを断れば悪者になる”ように仕向けましょう」\n\n龍馬は苦笑しつつも頷く。\n\n「……あんたの言うことは、時々ゾッとするほど怖ぇな。\nだが、確かにそれも一つの道だ」\n\n交渉の場では、龍馬は“大義”を強調し、\n相手に強い社会的プレッシャーをかけて同盟を成立させた。\n\nナギが静かに語る。\n\n「この戦術は、表向きは平和的ですが、\n裏では“断れない圧力”を使う方法です。\n未来には“やむを得ない同盟”として語られるため、LPは1減少しました」",
            "button_label_n": "▶次の章へ進む",
            "lp": -1,
            "next": "7"
          }
        },
        {
          "text": "ハーバード流交渉術",
          "result": {
            "text": "ナギが即座に解説を始めた。\n\n「ハーバード流交渉術ですね。これは“立場”ではなく“本当の利益”に目を向ける交渉法です。\n相手を敵ではなく、共に問題を解決する仲間として扱い、\n“双方にとっての共通利益”を探ることで合意を目指します」\n\nナギは続ける。\n\n「薩摩と長州の場合、“幕府を倒して新しい国を作る”という共通目標があります。\nこの戦術で交渉すれば、双方の溝を越えて手を結ばせることができます」\n\n{player_name}は、占い師の口調で龍馬に助言する。\n\n「どちらの藩も、未来の日本のために手を結ぶべき時が来ています。\n立場を越えて“未来の国作り”という共通の目的を語りましょう」\n\n龍馬は大きく頷き、微笑む。\n\n「なるほど……未来を見据えるか。面白ぇ、やってみよう」\n\nナギが誇らしげに囁く。\n\n「この戦術は、英雄としての正義や理想を際立たせる手法です。\n未来では“坂本龍馬は国をまとめた英雄”として語り継がれます。\nその結果、LPが1増加しました」\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 1,
            "next": "7"
          }
        }
      ]
    },
    "7": {
      "title": "薩長同盟、成立す",
      "image": "img_chapter7.png",
      "text": "交渉の場に現れた坂本龍馬は、まるで別人のような落ち着きと自信に満ちていた。",
      "button_label_r": "▶続きを読む",
      "story": "{player_name}は、その背中を静かに見つめる。ナギの声が、静かに囁く。\n\n「これまでのあなたの選択で、龍馬は最適な交渉戦術を選び取りました。どの戦術であれ、今の龍馬は“最善の交渉方法”を会得しています」交渉の席では、薩摩の西郷隆盛と長州の桂小五郎が対峙し、張り詰めた空気が漂っていた。だが、龍馬は堂々と切り出した。\n\n「ここで争いを続ければ、滅びるのは俺たち全員だ。だが、手を組めば──未来は俺たちのものになる」\n\nその言葉には、熱も、理も、義も、すべてが込められていた。西郷がじっと龍馬を見つめ、微かに笑う。\n\n「……坂本さん、あんた、面白か男ばい。そいで、嘘のなか気持ちが、きっと本物じゃろう」\n\n桂もまた、静かに頷く。\n\n「坂本さん、あなたの言葉には、妙に心が動かされる……この話、乗りましょう」\n\n──その瞬間、歴史は大きく動いた。\n\n薩摩と長州、ついに手を結ぶ。ナギの声が、わずかに誇らしげに響く。「これで、未来は正しい流れに戻りました。“坂本龍馬、薩長同盟を実現せし”──この言葉は、未来の教科書に必ず刻まれるでしょう」{player_name}は、静かに胸を撫で下ろす。“最善の道”を選び、未来の英雄伝説を自らの手で守り抜いたのだ。\n\nその夜、龍馬は満足げに杯を掲げた。\n\n「なぁ、{player_name}。お前のおかげで、俺は一歩踏み出せた。この国は、きっと変わるぜ」\n\nその笑顔は、まさに未来の英雄そのものだった。\n\n薩長同盟が無事に成立し、夜も更けた頃。坂本龍馬との祝杯の席がひと段落したタイミングで、ナギがそっと囁いた。「せっかくですし、今の交渉に関わった人物について、少しお話してみませんか？」ナギは、{player_name}に小さな選択肢を提示する。\n",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "西郷隆盛について教えて",
          "result": {
            "text": "ナギは、にこやかに説明を始めた。\n\n「西郷隆盛さんは、“薩摩のリーダー”として知られる人物です。\nとても優しくて義理堅く、みんなから“西郷どん（せごどん）”と親しまれていました」\n\nナギは淡々と、しかしやさしい声で続ける。\n\n「歴史上では、“明治維新の立役者”として有名で、\n日本を新しくするために大きな力を発揮しました。\nでも、最後は政府と意見が合わず、西南戦争という大きな戦いを起こしてしまいました」\n\n「ちなみに、西郷さんはとても動物好きで、犬をたくさん飼っていたことでも知られています。\n“西郷どんの銅像”に一緒にいる犬は、実際に飼っていた犬なんですよ」\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "8"
          }
        },
        {
          "text": "桂小五郎について教えて",
          "result": {
            "text": "ナギは、落ち着いた声で説明を始めた。\n\n「桂小五郎さんは、長州藩のリーダーで、\n“日本一の逃げ上手”とも呼ばれた人です」\n\nナギは穏やかに解説する。\n\n「実は、桂さんはとても頭の良い人で、戦いを避けて\n“話し合いで物事を解決するのが大事”と考えていました。\n幕府から何度も命を狙われましたが、そのたびに上手に逃げて生き延びたことから、\n“逃げの小五郎”というあだ名がついたんです」\n\n「ちなみに、桂さんはのちに“木戸孝允（きどたかよし）”と名前を変えて、\n明治時代の政治でも大きな役割を果たしました」",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "8"
          }
        },
        {
          "text": "二人ともあまり興味がない",
          "result": {
            "text": "ナギは、くすっと笑ってから、別の話を始めた。\n\n「それでは、薩長同盟にまつわるちょっとした豆知識をお話ししましょうか」\n\nナギは語り出す。\n\n「実は、薩長同盟が結ばれた時代、江戸の町では“写真”が流行り始めていました。\n当時の日本には、外国から伝わった“写真館”という場所が登場し、\n特に若者たちの間で“写真を撮ること”が一大ブームになっていたんです」\n\n「幕末の志士たちも、実はたくさんの写真を残していて、\n坂本龍馬の写真も“日本最古の人物写真の一つ”として有名です」\n\nナギは微笑むように締めくくる。\n\n「歴史の裏側には、意外な文化や流行も隠れているものですね」\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "8"
          }
        }
      ]
    },
    "8": {
      "title": "未来の国を描く夜",
      "image": "img_chapter8.png",
      "text": "薩長同盟が成立し、日本の未来は大きく動き始めていた。しかし、坂本龍馬の目はその先を見据えていた。",
      "button_label_r": "▶続きを読む",
      "story": "ある夜、龍馬は仲間たちを集めた。西郷隆盛、桂小五郎、後藤象二郎など、名だたる面々が顔を揃える。\n\n「これからの日本をどう作るか、意見を出し合おうじゃねぇか」龍馬の呼びかけで、激しい討論が始まった。\n\n「まずは新しい政権の仕組みが必要だ」「財政はどうする」「外国との関係は？」男たちの議論は白熱し、夜が更けるほどに熱気は増していく。\n\nそんな中、{player_name}はひとり静かにスマホを取り出し、ナギの議事録アプリを起動した。ナギの声が、冷静に囁く。「議事録アプリ、起動。討論内容をリアルタイムで整理し、未来の国家構想を自動生成します」アプリは瞬く間に会話を整理し、核心だけを抜き出していく。\n\n「まとめ完了。“未来の国の形”として最適化された案を提示できます」\n\n{player_name}は、さりげなく龍馬に耳打ちする。\n\n「みなさんの意見をまとめてみました。ご覧ください」\n\n龍馬は紙を受け取り、目を通すなり驚愕した。「これは……すげぇ……まるで未来からの手紙みたいだ。みんなの意見が、こんなにうまくまとまるなんて……」その内容は、まさに“船中八策”そのものだった。「これなら、誰にでもわかりやすく、国の道筋が示せる。よし、これを新しい国の指針にしよう！」仲間たちもその案に大きく頷く。\n\nナギがひっそりと囁く。\n\n「こうして“船中八策”は生まれました。史実に記録がほとんど残っていないのは、この議事録アプリで瞬時にまとめたからかもしれませんね」\n\n{player_name}は、未来を裏から支えた手応えを、静かに胸に刻んだ。\n\nその夜、龍馬は新たな決意を語る。「これを武器に、次は幕府に挑む時だ──大政奉還、いよいよだ」討論が終わり、船中八策が生まれた夜。\n\nふと、ナギがささやいた。\n\n「せっかくですし、この場面に関係する“豆知識”を聞いてみませんか？」",
      "button_label_c": "▶選択してください",
      "choices": [
        {
          "text": "船中八策って、どんな内容だったの？",
          "result": {
            "text": "ナギは静かに説明を始めた。\n\n「船中八策は、坂本龍馬が考えた、日本を新しくするための政治改革の基本方針です。\n土佐藩の後藤象二郎に示したもので、“新しい日本の未来像”を描いたものと言えます」\n\nナギは、やや専門的な言葉を交えつつ、わかりやすく語る。\n\n「簡単にまとめると、\n\n1️⃣ 政権を天皇に返上すること\n\n2️⃣ 新しい政府を作ること\n\n3️⃣ 法律を整備すること\n\n4️⃣ 海外との自由貿易を進めること\n\n5️⃣ 海軍の整備を進めること\n\n6️⃣ 全国共通のお金の仕組みを作ること\n\n7️⃣ 教育を広めて人材を育てること\n\n8️⃣ 議会を作って政治に民意を反映させること\n\nという8つの内容です」\n\n「この八策は、後に“日本の近代化の設計図”として非常に高く評価されています。\nつまり、未来の日本の姿を先取りしていたとも言えるのです」\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "9"
          }
        },
        {
          "text": "後藤象二郎って、だれ？",
          "result": {
            "text": "ナギは落ち着いた口調で語り始めた。\n\n「後藤象二郎は、土佐藩の実力者であり、坂本龍馬と深く関わった人物です。\n特に“大政奉還”の実現に大きく貢献しました」\n\nナギは、後藤の意外な一面も交えつつ説明する。\n\n「もともとは保守的で慎重な性格でしたが、龍馬に説得されて考え方を変えました。\nこの船中八策を公表するためにも力を貸し、大政奉還の流れを作った重要人物です」\n\n「明治時代には政府の要職に就き、警察や行政の近代化にも関わりました。\nつまり、“龍馬の夢を実現させた実務家”とも言える存在です」\n\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "9"
          }
        },
        {
          "text": "大政奉還って、なんだっけ？",
          "result": {
            "text": "ナギは少し厳かな口調で説明を始めた。\n\n「大政奉還は、日本の政治の歴史を大きく変えた出来事です。\n簡単に言うと、“江戸幕府が260年以上続けた政治の権力を、天皇に返したこと”です」\n\nナギは、その意義についても踏み込んで語る。\n\n「これにより、江戸時代の武士中心の政治から、\n天皇を中心とした新しい政治体制へと切り替わる道筋が作られました。\nただし、天皇に返したからといって、すぐに政治が安定したわけではなく、\nその後の明治維新で、さらに多くの改革が必要となりました」\n\n「坂本龍馬は、この大政奉還の実現を陰で支えたキーパーソンであり、\n“日本を争いなく平和的に変えた英雄”として、歴史に名を残すことになったのです」",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "9"
          }
        }
      ]
    },
    "9": {
      "title": "未来を動かす準備",
      "image": "img_chapter9.png",
      "text": "船中八策──日本の未来を描く大きな青写真はついに完成した。",
      "button_label_r": "▶続きを読む",
      "story": "だが、坂本龍馬は紙にまとめられた策をじっと見つめ、険しい表情を崩さなかった。\n\n「この策は、理想を描いたものだ。でも、現実を動かさなきゃ、ただの紙切れで終わっちまう……」龍馬は真剣な眼差しで{player_name}を見つめた。「これを実現するには、まず幕府に政権を返上させる必要がある。つまり──大政奉還を成し遂げなきゃならねぇ」\n\n{player_name}はポケットの中でそっとスマホを取り出し、ナギのメッセージを確認した。『その通りです。政権を動かすには、幕府に自ら手を引かせる必要があります。\n大政奉還は、日本を新しくするための不可欠な一歩です』──ナギ\n\nナギのメッセージはさらに続いた。『ここで鍵を握るのは土佐藩です。土佐は、討幕派の薩摩・長州と違い、幕府にも討幕派にも完全には属さない中立的な立場にあります。そのため、幕府に意見を届けられる数少ない藩のひとつです』──ナギ\n\n『実際、歴史上でも土佐藩の働きかけが、大政奉還を実現させた大きな要因となりました。坂本龍馬が土佐を動かせば、幕府が動くのは時間の問題です』──ナギ\n\n{player_name}は、画面を見つめながら、ゆっくりと龍馬に語りかけた。「土佐藩こそが、この国の未来を左右する鍵になるかもしれません。土佐を動かせば、幕府も自然に動くはずです」龍馬は深く頷き、すぐに問いかけた。「でも、土佐を動かすには、どうすればいい……？」\n\nスマホの画面に、新たなナギのメッセージが表示された。『実は、あなたが以前、長崎で進めた“ライフルの大量購入”が、今になって大きな意味を持ちます。土佐藩は、薩摩・長州の軍事力に強い警戒心を抱いており、そこにあなたの“ライフル購入の事実”が加われば、土佐は動かざるを得なくなるでしょう』──ナギ\n\n『戦わずして政権を動かすための“最後の切り札”です』──ナギ\n\n{player_name}は、スマホの画面をそっと閉じ、静かに龍馬に助言した。\n\n「土佐が最も恐れているのは、戦になることです。もし、“薩摩・長州は本気で武力行使も辞さない”という空気が伝われば、土佐は必ず動くでしょう。実は、長崎でのライフル取引が、まさにその“切り札”になるはずです」龍馬は驚き、そしてニヤリと笑った。\n\n「まさか、あの時の取引が、こんなところで生きるとはな……戦わずして勝つ──まさに、それだ。よし、土佐に“薩摩・長州の本気度”をしっかり知らせろ。これで幕府を動かす道筋は整った」\n\nスマホの画面には、次のナギのメッセージが表示された。\n\n『土佐藩は間もなく動き出します。次は幕府への直接交渉──その前に、事前練習を行いましょう』──ナギ\n\n龍馬は拳を握り、力強く言った。「幕府との交渉、本番での失敗は許されねぇ。だからこそ、今のうちに徹底的に準備するんだ。俺の交渉の腕を、ここで鍛えてくれ！」",
      "button_label_c": "▶ 次へ",
      "choices": [
        {
          "text": "対話シミュレーションアプリを起動する",
          "result": {
            "result_image": "img_chapter9_2.png",
            "text": "スマホの画面が静かに輝き、ナギのメッセージが浮かび上がる。\n\n『対話シミュレーションアプリ、起動完了。幕府重臣たちの思考パターンを再現した模擬交渉データを準備しました。ただし、スマホを直接見せるわけにはいかないので、全て手書きで記録してください。』\n\n{player_name}は苦笑しながらも、夜を徹してナギの指示通り、細かなシナリオを紙に書き写していく。幕府重臣の性格、発言、予想される反応──それはまるで未来からの「交渉絵巻」のようだった。\n\n翌日、港町の小さな茶屋。龍馬は{player_name}が手にした束の紙に目を丸くする。「なんだこれは？　まるで占い師の台本だな。」{player_name}は静かに頷く。「これは、あなたのために用意した“未来の交渉稽古”です。台詞に従って、交渉の練習をしてみましょう。」龍馬は半信半疑ながらも、紙芝居のように一枚一枚をめくりながら読み進めていく。\n\n「なるほど……こう切り出すのか。ほう、こっちは意外と難しいな……。」\n\n次第に真剣な眼差しで台本に向かい、龍馬はまるで舞台役者のように声を張り、何度も交渉の台詞を繰り返した。「ふむ、これならいけるかもしれねぇ……面白ぇ。もう一回やってみよう！」アナログの紙芝居は、未来を動かす最強の“交渉指南書”となった──。\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "10"
          }
        }

      ]
    },
    "10": {
      "title": "大政奉還、成る",
      "image": "img_chapter10.png",
      "choice_image": "img_chapter10_2.png",
      "text": "江戸城の奥深く──坂本龍馬は、静かに深呼吸しながら交渉の場へ向かった。",
      "button_label_r": "▶続きを読む",
      "story": "すでに土佐藩からの強い進言は幕府に届き、薩摩・長州の軍事力、長崎でのライフル取引の話まで、\n幕府の耳にもしっかりと伝わっている。だが、龍馬の心は静かだった。すべては{player_name}とナギが用意した対話シミュレーションの通りだったからだ。\n\n幕府の重臣たちは厳しい顔で龍馬を迎える。「坂本、貴様は“政権を手放せ”と言うのか？」龍馬は堂々と答える。「はい。けれど、これは“幕府を倒す”話ではありません。\n“日本を守るための、もっとも穏やかな道”です」\n\n幕府重臣たちの目が鋭くなる。\n\nだが、龍馬は淡々と続けた。ナギのシミュレーションで予測した通りの流れだった。「今、幕府は四面楚歌です。政権を手放さずに争えば、必ず滅びます。しかし──政権を返上し、時代の転換を自ら主導すれば、あなた方は“平和的に国を救った英雄”として後世に名を残せるでしょう」\n\n重臣たちの顔に、わずかに動揺が走る。\n\n「さらに、政権を手放しても、幕府の家格や影響力は残せます。新たな政府でも、必ず経験ある者の力が必要になるのは当然のことです」\n\n龍馬は、あえて“逃げ道”をしっかり残した。これも、すべて事前にナギのアドバイスで練り込んだ“最適解”だった。重臣たちは互いに視線を交わし、やがて、最年長の重臣が重い口を開いた。\n\n「……そこまで読まれていたか。確かに、今ここで政権を手放せば、我らは滅びずに次の時代に繋げることができるかもしれぬ……」別の重臣も、低く呟く。「……戦で滅びるより、遥かに賢明だ。ここは、決断の時だな……」\n\nついに、幕府は政権返上を受け入れた。\n\n「──政権を、返上しよう。これは敗北ではない。未来を守るための“選択”だ……」\n",
      "button_label_c": "▶ 次へ",
      "choices": [
        {
          "text": "交渉が終わった後──",
          "result": {
            "result_image": "img_chapter10_2.png",
            "text": "交渉が終わった後、坂本龍馬は静かに息を吐いた。まるで、すべてが最初から決まっていたかのような冷静さだった。\n\n{player_name}の懐にあるスマホには、ナギからのメッセージが表示された。\n\n『交渉は事前シミュレーション通りに収束しました。あなたと私が選んだ最適解が、歴史を正しい流れへ導きました』──ナギ\n\n龍馬は、ふっと遠くを見つめながら微笑んだ。「……これで、日本は次の時代へ進むことになる。だが、ここから先は、また別の試練が待っているかもしれねぇな……」\n\n夜の静けさの中、{player_name}のスマホに、ナギからの新たなメッセージが届く。『警告：歴史上、避けられない重大事象が接近中。坂本龍馬の身に、定められた運命の危機が迫っています』──ナギ\n\n歴史の歯車は、次なる局面へと動き始めていた──。\n",
            "button_label_n": "▶次の章へ進む",
            "lp": 0,
            "next": "11"
          }
        }

      ]
    },

    "11": {
      "title": "運命の刻限",
      "image": "img_chapter11.png",
      "choice_image": "img_chapter11_2.png",
      "text": "大政奉還は成し遂げられ、日本は新たな時代へと歩み出した。",
      "button_label_r": "▶続きを読む",
      "story": "坂本龍馬は、町の誰もが称える英雄となり、彼の名は人々の口から口へと伝わっていた。だが、{player_name}のスマホには、ナギからの冷静な警告が届いていた。\n\n『警告：歴史上、避けられない重大事象が接近中。坂本龍馬の身に、定められた運命の危機が迫っています』──ナギ\n\nナギは、淡々と未来の記録を示す。\n\n『このままでは、坂本龍馬は数日以内に、京都・近江屋で命を落とします。この暗殺は、歴史の“固定事象”として未来に深く刻まれています。以後の日本の政治・社会に不可欠な転換点として、その死は必要不可欠です。』ナギの画面には、未来の日本における坂本龍馬の英雄像が次々と映し出される。銅像、教科書、記念館──彼は「日本の英雄」として永遠に語り継がれる存在だった。\n\nナギは、当然のように言い放つ。\n\n『未来の安定と正しい歴史のために、坂本龍馬の死を受け入れることを推奨します。』だが、{player_name}はその言葉に、どうしても心が晴れなかった。これまで、{player_name}とナギは、未来の知識とAIの力を使って龍馬に“英雄の役割”を完璧に演じさせてきた。大政奉還も、交渉の成功も──すべては{player_name}とナギが導き、龍馬は知らぬ間にその“理想の未来像”に沿って動かされてきた。そのことを思い返すと、胸に重くのしかかるものがあった。\n\n「……なんだか、腑に落ちないんだ」\n\n{player_name}は、スマホを握りしめながら、ぽつりとつぶやく。「ここまで龍馬に背負わせておいて、最後だけ“お疲れ様、あとは死んでね”っていうのは……どうにも割り切れないんだ。英雄としての役割は果たしてくれた。だったら、せめて“生きる自由”ぐらい残してあげたい……」\n\nナギはしばらく無言だった。しかし、しばらくして、スマホの画面にいつもとは違うメッセージが浮かび上がる。\n\n『……ご意見を受け、シミュレーションを再実行中。条件：未来の安定を維持しつつ、坂本龍馬を救出するルートの探索』\n\n数秒後、ナギの結論が表示される。\n\n『特異ケースを検出。坂本龍馬の“死”は、あくまで“歴史上の記録”として固定される事象です。実態としては、死を偽装することで“未来の安定”を維持しつつ、本人を救出することが理論上可能であると判明しました。』ナギのメッセージは、さらに続く。\n\n『この方法は極めて特殊な裏技ですが、史実を守りながら、坂本龍馬を救出できる“唯一のルート”です。あなたの強い希望により、例外的に実行可能です。』\n\nナギの画面には、2つの選択肢が表示された。\n\n",
      "button_label_c": "▶ 究極の2択へ",
      "choices": [
        {
          "text": "坂本龍馬の死を受け入れる",
          "result": {
            "result_image": "img_chapter11_4.png",
            "text": "京都、近江屋──その夜、街はいつも通りの静けさに包まれていた。坂本龍馬は、あの日と同じように、無邪気な笑みを浮かべながら酒を酌み交わしていた。\n\n「この先の日本がどう転ぶかわからねぇが、俺はやることはやったつもりだ。あとは、風に任せるだけだな……」\n\n{player_name}は、スマホを握りしめたまま、ただ黙ってその姿を見守ることしかできなかった。ナギの画面には、淡々としたメッセージが表示されている。『未来の安定は維持されています。坂本龍馬の死は、歴史に必要不可欠な出来事です。あなたの選択は、未来を正しい流れに導きました。』\n\nやがて夜が更け、あの“事件”は訪れる。襲撃者たちが近江屋に踏み込んだとき、龍馬は最後まで逃げず、堂々と刀を抜くこともなく、まるで覚悟を決めたように静かにその最期を迎えた。誰に知られることもなく、坂本龍馬の命は尽きた。\n\n数日後、町には「坂本龍馬、暗殺」という噂が瞬く間に広まった。人々はその死を悼み、彼の志と行動を語り継いだ。スマホの画面には、ナギからの最終報告が届く。『未来の安定は確認済み。坂本龍馬は、日本の英雄として永遠に語り継がれる存在となりました。』{player_name}は、胸に重く残る感情を抱えながら、静かにスマホの画面を閉じた。\n\n「……これでよかったのかもしれない。でも、きっと、彼の意志はこれからも生き続けるはずだ──」\n\nナギは最後に穏やかに告げる。『これで、あなたの役目は一つの区切りを迎えました。次は、未来へ戻るための最終調整フェーズに入ります。』\n\n静かに夜が明けていく。{player_name}は、次の“最後の章”への準備を始めるのだった──。\n",
            "button_label_n": "▶最終章へ進む",
            "lp": 0,
            "next": "12"
          }
        },
        {
          "text": "坂本龍馬を裏で救出する",
          "result": {
            "result_image": "img_chapter11_3.png",
            "text": "夜の京都、近江屋──静まり返った屋敷の裏手では、坂本龍馬が密かに脱出の準備を整えていた。だがその前に、{player_name}は、静かに口を開いた。\n\n「……龍馬さん、これから話すことは、信じがたいことかもしれません。でも、今この状況で、あなたを救うには、もう隠しておけません。」\n\n{player_name}は、深く息をつき、すべてを打ち明けた。自分は未来から来たこと、この時代の歴史がどうなるかを知っていること、そして坂本龍馬という人物が未来で“英雄”として語り継がれる存在であること──だが、その未来を守るためには、龍馬が“死んだこと”にしなければならないことも。龍馬はじっと話を聞いていた。やがて、ふっと笑みを浮かべる。\n\n「……なるほどな。未来ってのは、ずいぶん冷静で、優しいもんだな。だが、お前が命懸けでここまで俺を守ろうとするなら、信じないわけにはいかねぇな。」{player_name}はそっとスマホの画面を見せる。そこには、未来の日本で英雄として語られる坂本龍馬の姿──銅像、教科書、子供たちがその名を学ぶ光景が映し出されていた。\n\n「……なるほど、俺は未来じゃ“死んだこと”になってるってわけか。面白ぇじゃねぇか。英雄として死んで、裏では自由に生きる……それも悪くねぇ。」\n\n龍馬はニヤリと笑い、{player_name}に深く頭を下げる。「お前のおかげで、もう一つの生き方を見つけたぜ。誰にも知られず、ただ自由に生きる人生も、案外悪くねぇな。」そう言い残し、龍馬は裏口から静かに姿を消した。直後、暗殺者たちが屋敷に踏み込む。\n\n「……すでに死んでいる!?」\n\n彼らは驚きつつも、「我々が仕留めたことにしておかねば手柄にならぬ」と目配せし、偽の遺体を斬りつけた。こうして“坂本龍馬暗殺”は史実として完全に固定された。数日後、長崎からの密航船に乗った龍馬は、オランダ経由でアメリカ西海岸を目指す航路に就く。出航直前、{player_name}のもとに一通の手紙が届く。\n\n「未来の英雄としての役割は、あんたらのおかげで果たした。これからは“Ryu（リュウ）”として、新しい自由な人生を歩くことにするよ。日本も、未来も、安心して任せたぜ──坂本龍馬」\n\nナギのスマホには、最後の確認メッセージが表示される。『未来の安定は維持されています。坂本龍馬は、日本の英雄として歴史に刻まれ、同時に誰にも知られぬ“影の人生”を歩み始めました。』プレイヤーは、深い安堵とわずかな寂しさを胸に抱えながら、静かに“最後の章”への準備を始めた。",
            "button_label_n": "▶最終章へ進む",
            "lp": 0,
            "next": "12"
          }
        }

      ]
    },

    "12": {
      "title": "最終章：未来への帰還",
      "image": "img_chapter13.png",
      "text": "すべての使命を終えた夜、{player_name}は、京都の静かな空の下で、ふとスマホの画面を見つめていた。",
      "button_label_r": "▶続きを読む",
      "story": "ナギからのメッセージは、穏やかに表示される。\n\n『すべてのシミュレーションは完了しました。歴史の流れは安定し、日本は未来へと正しく進みます。』\n\nほんの少し前まで、この世界は騒乱の渦中にあり、{player_name}はそのただ中で、AIとともに“影の立役者”として動いていた。坂本龍馬は、歴史の中で英雄としての役割を果たし、日本は無事に新たな時代を迎えることになった。ナギは、最後のメッセージを静かに送る。\n\n『これで、あなたの役目は完全に終了しました。坂本龍馬と共に過ごした時間を経て、あなたは何を感じましたか？』\n\n{player_name}は、ゆっくりと目を閉じて思い返す。交渉術、未来の知識、AIシミュレーション──それらの力を駆使しながらも、結局のところ、最後の決断を下したのは自分自身の“心”だった。\n\n「未来は、数字やシミュレーションだけじゃ動かせない。そこに生きる“人間の想い”が、やっぱり一番の力なんだ……」\n\nナギは、まるで微笑むようなメッセージを返す。『あなたは、未来の知恵と人の心、その両方を使いこなした“特別な存在”です。この世界で得たすべての経験は、あなたの中に確かに刻まれました。』スマホの画面には、最後のメッセージが映し出される。『これより、未来への帰還を開始します──お疲れさまでした。』──ナギ\n\n画面がゆっくりと暗転する。\n\n次の瞬間、眩い光に包まれ、{player_name}の意識は、現代の自室へと引き戻された。すべては、遠い過去の“夢”だったのか、それとも──。\n\n机の上には、どこか見覚えのあるスマホがひっそりと置かれていた。\n",
      "button_label_c": "▶終わり",
      "choices": []




    }
  }
}